# 6 Pamoka: Pandas #2

In [5]:
# !pip3 install pandas
import pandas as pd
import numpy as np

### 1. Trukstami Duomenys

In [6]:
df = pd.DataFrame(np.random.rand(5,6), 
                ['a', 'b', 'c', 'd', 'e'], 
                ['U', 'V', 'W', 'X', 'Y', 'Z'])

In [7]:
df

          U         V         W         X         Y         Z
a  0.922965  0.133949  0.299491  0.221957  0.084694  0.598735
b  0.372609  0.739499  0.926529  0.784357  0.897677  0.163551
c  0.016958  0.310164  0.381014  0.816599  0.484805  0.205125
d  0.403751  0.085628  0.384796  0.132179  0.432360  0.026625
e  0.547058  0.370504  0.473615  0.619465  0.470644  0.190577

In [8]:
table = df[df > 0.15]

In [9]:
table

          U         V         W         X         Y         Z
a  0.922965       NaN  0.299491  0.221957       NaN  0.598735
b  0.372609  0.739499  0.926529  0.784357  0.897677  0.163551
c       NaN  0.310164  0.381014  0.816599  0.484805  0.205125
d  0.403751       NaN  0.384796       NaN  0.432360       NaN
e  0.547058  0.370504  0.473615  0.619465  0.470644  0.190577

In [10]:
table.isnull()

       U      V      W      X      Y      Z
a  False   True  False  False   True  False
b  False  False  False  False  False  False
c   True  False  False  False  False  False
d  False   True  False   True  False   True
e  False  False  False  False  False  False

In [11]:
table.isnull().sum()

U    1
V    2
W    0
X    1
Y    1
Z    1
dtype: int64

In [12]:
False == 0

True

In [13]:
True == 1

True

In [14]:
table['V'].isnull()

a     True
b    False
c    False
d     True
e    False
Name: V, dtype: bool

In [15]:
table['V'].isnull().sum()

2

In [16]:
table.dropna()

          U         V         W         X         Y         Z
b  0.372609  0.739499  0.926529  0.784357  0.897677  0.163551
e  0.547058  0.370504  0.473615  0.619465  0.470644  0.190577

In [17]:
table.dropna(axis=1)

          W
a  0.299491
b  0.926529
c  0.381014
d  0.384796
e  0.473615

In [18]:
table.dropna(thresh=5)

          U         V         W         X         Y         Z
b  0.372609  0.739499  0.926529  0.784357  0.897677  0.163551
c       NaN  0.310164  0.381014  0.816599  0.484805  0.205125
e  0.547058  0.370504  0.473615  0.619465  0.470644  0.190577

Null reiksmiu uzpildymas

In [19]:
table.fillna('not a null')

            U           V         W           X           Y           Z
a    0.922965  not a null  0.299491    0.221957  not a null    0.598735
b    0.372609    0.739499  0.926529    0.784357    0.897677    0.163551
c  not a null    0.310164  0.381014    0.816599    0.484805    0.205125
d    0.403751  not a null  0.384796  not a null     0.43236  not a null
e    0.547058    0.370504  0.473615    0.619465    0.470644    0.190577

In [23]:
table['X'].mean()

0.61059432744093

`vidutines reiksmes priskyrimas`: norime priskirti vidutine reiksme stulpeliui

In [24]:
table['X'].fillna(value=table['X'].mean())

a    0.221957
b    0.784357
c    0.816599
d    0.610594
e    0.619465
Name: X, dtype: float64

`savo reiksmes priskyrimas`

In [26]:
table['U'].fillna(1.0)

a    0.922965
b    0.372609
c    1.000000
d    0.403751
e    0.547058
Name: U, dtype: float64

## Grupavimas

In [29]:
duomenys = {'Šalis': ['Lietuva',
  'Lietuva',
  'Lietuva',
  'Latvija',
  'Latvija',
  'Latvija',
  'Estija',
  'Estija',
  'Estija'],
 'Miestas': ['Vilnius',
  'Kaunas',
  'Klaipėda',
  'Ryga',
  'Ventspilis',
  'Daugpilis',
  'Talinas',
  'Tartu',
  'Pernu'],
 'Gyv': [541, 287, 147, 716, 43, 105, 400, 101, 46]}

In [30]:
df = pd.DataFrame(duomenys)

In [32]:
df.groupby("Šalis")

In [33]:
df.groupby("Šalis").mean()

/var/folders/9h/pxgsfw7n1h1bdydh77wmr1q40000gn/T/ipykernel_16701/2358123355.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Šalis").mean()

                Gyv
Šalis
Estija   182.333333
Latvija  288.000000
Lietuva  325.000000

In [34]:
df.groupby("Šalis").sum()

/var/folders/9h/pxgsfw7n1h1bdydh77wmr1q40000gn/T/ipykernel_16701/319958757.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Šalis").sum()

         Gyv
Šalis
Estija   547
Latvija  864
Lietuva  975

In [35]:
df.groupby("Šalis").count()

         Miestas  Gyv
Šalis
Estija         3    3
Latvija        3    3
Lietuva        3    3

In [36]:
df.groupby("Šalis").max()

            Miestas  Gyv
Šalis
Estija        Tartu  400
Latvija  Ventspilis  716
Lietuva     Vilnius  541

In [38]:
df.groupby("Šalis").min()

           Miestas  Gyv
Šalis
Estija       Pernu   46
Latvija  Daugpilis   43
Lietuva     Kaunas  147

In [40]:
df.groupby("Šalis").agg({'Miestas': 'count', 'Gyv': 'min'})

         Miestas  Gyv
Šalis
Estija         3   46
Latvija        3   43
Lietuva        3  147

In [41]:
df.groupby("Šalis").sum().loc['Lietuva']

/var/folders/9h/pxgsfw7n1h1bdydh77wmr1q40000gn/T/ipykernel_16701/1413998473.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Šalis").sum().loc['Lietuva']

Gyv    975
Name: Lietuva, dtype: int64

In [42]:
df.groupby("Šalis").describe()

          Gyv
        count        mean         std    min    25%    50%    75%    max
Šalis
Estija    3.0  182.333333  190.500219   46.0   73.5  101.0  250.5  400.0
Latvija   3.0  288.000000  371.952954   43.0   74.0  105.0  410.5  716.0
Lietuva   3.0  325.000000  199.729818  147.0  217.0  287.0  414.0  541.0

In [43]:
df.groupby("Šalis").describe().transpose()

Šalis          Estija     Latvija     Lietuva
Gyv count    3.000000    3.000000    3.000000
    mean   182.333333  288.000000  325.000000
    std    190.500219  371.952954  199.729818
    min     46.000000   43.000000  147.000000
    25%     73.500000   74.000000  217.000000
    50%    101.000000  105.000000  287.000000
    75%    250.500000  410.500000  414.000000
    max    400.000000  716.000000  541.000000

In [44]:
df.groupby("Šalis").describe().transpose()['Estija']

Gyv  count      3.000000
     mean     182.333333
     std      190.500219
     min       46.000000
     25%       73.500000
     50%      101.000000
     75%      250.500000
     max      400.000000
Name: Estija, dtype: float64

## Dataframe jungimas

In [78]:
df1 = df[0:6]

In [79]:
df1

     Šalis     Miestas  Gyv
0  Lietuva     Vilnius  541
1  Lietuva      Kaunas  287
2  Lietuva    Klaipėda  147
3  Latvija        Ryga  716
4  Latvija  Ventspilis   43
5  Latvija   Daugpilis  105

In [80]:
df2 = df[6:]

In [81]:
df2

    Šalis  Miestas  Gyv
6  Estija  Talinas  400
7  Estija    Tartu  101
8  Estija    Pernu   46

`Komentaras`: atsrgiai su duplikatais

In [82]:
pd.concat([df1, df2])    # .drop_duplicates() jeigu potencialiai gali lenta tureti identisku eiluciu
                         # .drop_duplicates(subset='Miestas')

     Šalis     Miestas  Gyv
0  Lietuva     Vilnius  541
1  Lietuva      Kaunas  287
2  Lietuva    Klaipėda  147
3  Latvija        Ryga  716
4  Latvija  Ventspilis   43
5  Latvija   Daugpilis  105
6   Estija     Talinas  400
7   Estija       Tartu  101
8   Estija       Pernu   46